; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob60) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate11)
	(at pallet1 distributor0)
	(clear crate7)
	(at pallet2 distributor1)
	(clear crate9)
	(at truck0 distributor0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 305)
	(at truck1 depot0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 314)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 depot0)
	(on crate0 pallet0)
	(= (weight crate0) 22)
	(at crate1 distributor0)
	(on crate1 pallet1)
	(= (weight crate1) 51)
	(at crate2 depot0)
	(on crate2 crate0)
	(= (weight crate2) 97)
	(at crate3 distributor1)
	(on crate3 pallet2)
	(= (weight crate3) 88)
	(at crate4 depot0)
	(on crate4 crate2)
	(= (weight crate4) 50)
	(at crate5 distributor0)
	(on crate5 crate1)
	(= (weight crate5) 64)
	(at crate6 depot0)
	(on crate6 crate4)
	(= (weight crate6) 24)
	(at crate7 distributor0)
	(on crate7 crate5)
	(= (weight crate7) 69)
	(at crate8 distributor1)
	(on crate8 crate3)
	(= (weight crate8) 83)
	(at crate9 distributor1)
	(on crate9 crate8)
	(= (weight crate9) 22)
	(at crate10 depot0)
	(on crate10 crate6)
	(= (weight crate10) 30)
	(at crate11 depot0)
	(on crate11 crate10)
	(= (weight crate11) 41)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate9)
		(on crate1 crate11)
		(on crate2 crate1)
		(on crate5 pallet1)
		(on crate7 crate0)
		(on crate8 crate2)
		(on crate9 pallet0)
		(on crate10 crate5)
		(on crate11 pallet2)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist1 crate7 crate5 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist1) (on crate7 crate5)
   added: (lifting hoist1 crate7) (clear crate5)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 9
2. (load hoist1 crate7 truck0 distributor0)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 69
   goals met: 0 of 9
3. (lift hoist1 crate5 crate1 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist1) (on crate5 crate1)
   added: (lifting hoist1 crate5) (clear crate1)
   changed: (fuel-cost) from 1 to 2
   goals met: 0 of 9
4. (load hoist1 crate5 truck0 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck0) (available hoist1)
   changed: (current_load truck0) from 69 to 133
   goals met: 0 of 9
5. (lift hoist1 crate1 pallet1 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist1) (on crate1 pallet1)
   added: (lifting hoist1 crate1) (clear pallet1)
   changed: (fuel-cost) from 2 to 3
   goals met: 0 of 9
6. (load hoist1 crate1 truck0 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   changed: (current_load truck0) from 133 to 184
   goals met: 0 of 9
7. (unload hoist1 crate5 truck0 distributor0)
   deleted: (in crate5 truck0) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck0) from 184 to 120
   goals met: 0 of 9
8. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 3 to 13
   goals met: 0 of 9
9. (unload hoist0 crate1 truck0 depot0)
   deleted: (in crate1 truck0) (available hoist0)
   added: (lifting hoist0 crate1)
   changed: (current_load truck0) from 120 to 69
   goals met: 0 of 9
10. (lift hoist2 crate9 crate8 distributor1)
   deleted: (at crate9 distributor1) (clear crate9) (available hoist2) (on crate9 crate8)
   added: (lifting hoist2 crate9) (clear crate8)
   changed: (fuel-cost) from 13 to 14
   goals met: 0 of 9
11. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 14 to 24
   goals met: 0 of 9
12. (load hoist2 crate9 truck0 distributor1)
   deleted: (lifting hoist2 crate9)
   added: (in crate9 truck0) (available hoist2)
   changed: (current_load truck0) from 69 to 91
   goals met: 0 of 9
13. (lift hoist2 crate8 crate3 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist2) (on crate8 crate3)
   added: (lifting hoist2 crate8) (clear crate3)
   changed: (fuel-cost) from 24 to 25
   goals met: 0 of 9
14. (load hoist2 crate8 truck0 distributor1)
   deleted: (lifting hoist2 crate8)
   added: (in crate8 truck0) (available hoist2)
   changed: (current_load truck0) from 91 to 174
   goals met: 0 of 9
15. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 25 to 35
   goals met: 0 of 9
16. (load hoist1 crate5 truck0 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck0) (available hoist1)
   changed: (current_load truck0) from 174 to 238
   goals met: 0 of 9
17. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 35 to 45
   goals met: 0 of 9
18. (drop hoist0 crate1 crate11 depot0)
   deleted: (lifting hoist0 crate1) (clear crate11)
   added: (available hoist0) (at crate1 depot0) (clear crate1) (on crate1 crate11)
   goals met: 1 of 9
19. (unload hoist0 crate9 truck0 depot0)
   deleted: (in crate9 truck0) (available hoist0)
   added: (lifting hoist0 crate9)
   changed: (current_load truck0) from 238 to 216
   goals met: 1 of 9
20. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 45 to 55
   goals met: 1 of 9
21. (lift hoist2 crate3 pallet2 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist2) (on crate3 pallet2)
   added: (lifting hoist2 crate3) (clear pallet2)
   changed: (fuel-cost) from 55 to 56
   goals met: 1 of 9
22. (load hoist2 crate3 truck0 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck0) (available hoist2)
   changed: (current_load truck0) from 216 to 304
   goals met: 1 of 9
23. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 56 to 66
   goals met: 1 of 9
24. (unload hoist1 crate5 truck0 distributor0)
   deleted: (in crate5 truck0) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck0) from 304 to 240
   goals met: 1 of 9
25. (drop hoist1 crate5 pallet1 distributor0)
   deleted: (lifting hoist1 crate5) (clear pallet1)
   added: (available hoist1) (at crate5 distributor0) (clear crate5) (on crate5 pallet1)
   goals met: 2 of 9
26. (load hoist0 crate9 truck1 depot0)
   deleted: (lifting hoist0 crate9)
   added: (in crate9 truck1) (available hoist0)
   changed: (current_load truck1) from 0 to 22
   goals met: 2 of 9
27. (lift hoist0 crate1 crate11 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 crate11)
   added: (lifting hoist0 crate1) (clear crate11)
   changed: (fuel-cost) from 66 to 67
   goals met: 1 of 9
28. (load hoist0 crate1 truck1 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck1) (available hoist0)
   changed: (current_load truck1) from 22 to 73
   goals met: 1 of 9
29. (lift hoist0 crate11 crate10 depot0)
   deleted: (at crate11 depot0) (clear crate11) (available hoist0) (on crate11 crate10)
   added: (lifting hoist0 crate11) (clear crate10)
   changed: (fuel-cost) from 67 to 68
   goals met: 1 of 9
30. (load hoist0 crate11 truck1 depot0)
   deleted: (lifting hoist0 crate11)
   added: (in crate11 truck1) (available hoist0)
   changed: (current_load truck1) from 73 to 114
   goals met: 1 of 9
31. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 68 to 78
   goals met: 1 of 9
32. (unload hoist2 crate11 truck1 distributor1)
   deleted: (in crate11 truck1) (available hoist2)
   added: (lifting hoist2 crate11)
   changed: (current_load truck1) from 114 to 73
   goals met: 1 of 9
33. (drop hoist2 crate11 pallet2 distributor1)
   deleted: (lifting hoist2 crate11) (clear pallet2)
   added: (available hoist2) (at crate11 distributor1) (clear crate11) (on crate11 pallet2)
   goals met: 2 of 9
34. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 78 to 88
   goals met: 2 of 9
35. (lift hoist0 crate10 crate6 depot0)
   deleted: (at crate10 depot0) (clear crate10) (available hoist0) (on crate10 crate6)
   added: (lifting hoist0 crate10) (clear crate6)
   changed: (fuel-cost) from 88 to 89
   goals met: 2 of 9
36. (load hoist0 crate10 truck1 depot0)
   deleted: (lifting hoist0 crate10)
   added: (in crate10 truck1) (available hoist0)
   changed: (current_load truck1) from 73 to 103
   goals met: 2 of 9
37. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 89 to 99
   goals met: 2 of 9
38. (unload hoist0 crate9 truck1 depot0)
   deleted: (in crate9 truck1) (available hoist0)
   added: (lifting hoist0 crate9)
   changed: (current_load truck1) from 103 to 81
   goals met: 2 of 9
39. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 99 to 109
   goals met: 2 of 9
40. (unload hoist1 crate10 truck1 distributor0)
   deleted: (in crate10 truck1) (available hoist1)
   added: (lifting hoist1 crate10)
   changed: (current_load truck1) from 81 to 51
   goals met: 2 of 9
41. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 109 to 119
   goals met: 2 of 9
42. (drop hoist1 crate10 crate5 distributor0)
   deleted: (lifting hoist1 crate10) (clear crate5)
   added: (available hoist1) (at crate10 distributor0) (clear crate10) (on crate10 crate5)
   goals met: 3 of 9
43. (load hoist0 crate9 truck1 depot0)
   deleted: (lifting hoist0 crate9)
   added: (in crate9 truck1) (available hoist0)
   changed: (current_load truck1) from 51 to 73
   goals met: 3 of 9
44. (lift hoist0 crate6 crate4 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist0) (on crate6 crate4)
   added: (lifting hoist0 crate6) (clear crate4)
   changed: (fuel-cost) from 119 to 120
   goals met: 3 of 9
45. (load hoist0 crate6 truck1 depot0)
   deleted: (lifting hoist0 crate6)
   added: (in crate6 truck1) (available hoist0)
   changed: (current_load truck1) from 73 to 97
   goals met: 3 of 9
46. (lift hoist0 crate4 crate2 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 crate2)
   added: (lifting hoist0 crate4) (clear crate2)
   changed: (fuel-cost) from 120 to 121
   goals met: 3 of 9
47. (load hoist0 crate4 truck1 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck1) (available hoist0)
   changed: (current_load truck1) from 97 to 147
   goals met: 3 of 9
48. (lift hoist0 crate2 crate0 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 crate0)
   added: (lifting hoist0 crate2) (clear crate0)
   changed: (fuel-cost) from 121 to 122
   goals met: 3 of 9
49. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 122 to 132
   goals met: 3 of 9
50. (unload hoist2 crate1 truck1 distributor1)
   deleted: (in crate1 truck1) (available hoist2)
   added: (lifting hoist2 crate1)
   changed: (current_load truck1) from 147 to 96
   goals met: 3 of 9
51. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 132 to 142
   goals met: 3 of 9
52. (drop hoist2 crate1 crate11 distributor1)
   deleted: (lifting hoist2 crate1) (clear crate11)
   added: (available hoist2) (at crate1 distributor1) (clear crate1) (on crate1 crate11)
   goals met: 4 of 9
53. (load hoist0 crate2 truck1 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck1) (available hoist0)
   changed: (current_load truck1) from 96 to 193
   goals met: 4 of 9
54. (unload hoist0 crate7 truck0 depot0)
   deleted: (in crate7 truck0) (available hoist0)
   added: (lifting hoist0 crate7)
   changed: (current_load truck0) from 240 to 171
   goals met: 4 of 9
55. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 142 to 152
   goals met: 4 of 9
56. (unload hoist2 crate2 truck1 distributor1)
   deleted: (in crate2 truck1) (available hoist2)
   added: (lifting hoist2 crate2)
   changed: (current_load truck1) from 193 to 96
   goals met: 4 of 9
57. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 152 to 162
   goals met: 4 of 9
58. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 162 to 172
   goals met: 4 of 9
59. (drop hoist2 crate2 crate1 distributor1)
   deleted: (lifting hoist2 crate2) (clear crate1)
   added: (available hoist2) (at crate2 distributor1) (clear crate2) (on crate2 crate1)
   goals met: 5 of 9
60. (unload hoist2 crate8 truck0 distributor1)
   deleted: (in crate8 truck0) (available hoist2)
   added: (lifting hoist2 crate8)
   changed: (current_load truck0) from 171 to 88
   goals met: 5 of 9
61. (drop hoist2 crate8 crate2 distributor1)
   deleted: (lifting hoist2 crate8) (clear crate2)
   added: (available hoist2) (at crate8 distributor1) (clear crate8) (on crate8 crate2)
   goals met: 6 of 9
62. (load hoist0 crate7 truck1 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck1) (available hoist0)
   changed: (current_load truck1) from 96 to 165
   goals met: 6 of 9
63. (lift hoist0 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 pallet0)
   added: (lifting hoist0 crate0) (clear pallet0)
   changed: (fuel-cost) from 172 to 173
   goals met: 6 of 9
64. (load hoist0 crate0 truck1 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck1) (available hoist0)
   changed: (current_load truck1) from 165 to 187
   goals met: 6 of 9
65. (unload hoist0 crate9 truck1 depot0)
   deleted: (in crate9 truck1) (available hoist0)
   added: (lifting hoist0 crate9)
   changed: (current_load truck1) from 187 to 165
   goals met: 6 of 9
66. (drop hoist0 crate9 pallet0 depot0)
   deleted: (lifting hoist0 crate9) (clear pallet0)
   added: (available hoist0) (at crate9 depot0) (clear crate9) (on crate9 pallet0)
   goals met: 7 of 9
67. (unload hoist0 crate0 truck1 depot0)
   deleted: (in crate0 truck1) (available hoist0)
   added: (lifting hoist0 crate0)
   changed: (current_load truck1) from 165 to 143
   goals met: 7 of 9
68. (drop hoist0 crate0 crate9 depot0)
   deleted: (lifting hoist0 crate0) (clear crate9)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 crate9)
   goals met: 8 of 9
69. (unload hoist0 crate7 truck1 depot0)
   deleted: (in crate7 truck1) (available hoist0)
   added: (lifting hoist0 crate7)
   changed: (current_load truck1) from 143 to 74
   goals met: 8 of 9
70. (drop hoist0 crate7 crate0 depot0)
   deleted: (lifting hoist0 crate7) (clear crate0)
   added: (available hoist0) (at crate7 depot0) (clear crate7) (on crate7 crate0)
   goals met: 9 of 9
